---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.IsMirrored
source: html/2f7e8448-b986-76b6-e2af-3fb5eae8782c.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.IsMirrored Property

States if the structural section of the element is mirrored.

## Syntax (C#)
```csharp
public bool IsMirrored { get; }
```